_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СтроительныеРаботы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УСОERP_СценарииПланированияПроектовСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСводногоСметногоРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтатьиСводныхСметныхРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонструктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммарнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UIDProject</Name>
					<Comment>Служебный реквизит, предназначен для хранения UID, загруженных из MSProject</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Веха</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритическаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийПроцесс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровнеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаЗадержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПредшественники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ТипыОграничений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОграничения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаОграничения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРесурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПредшественников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагрузкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Машиноемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтроительнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗависимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ТипыЗависимостейРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задержка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаЗадержки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Конструктивы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конструктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ТипыЗависимостейРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ТипыЗависимостейРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНачало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОкончание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНачало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоОкончание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Владелец.НовыйВариант Тогда 		
		
		УстановитьУсловноеОформление();
		
		ВидПланирования 	= Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный;
		
		Если Параметры.Свойство("НаДату") Тогда
			ЕстьОтборНаДату = Истина;
			НаДату = Параметры.НаДату;
		Иначе
			НаДату = ПолучитьПоследнююДатуИзменения(Объект.Ссылка);
		КонецЕсли;
		
		ЕстьОтборНаДату = Истина; 
		
		Если Объект.Ссылка.Пустая() Тогда 
			
			Если ЗначениеЗаполнено(Параметры.СценарийПланирования) Тогда 
				Объект.Владелец 	= Параметры.СценарийПланирования;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(Параметры.Родитель) Тогда 
				Объект.Родитель 	= Параметры.Родитель;
			КонецЕсли;	 
			
			Если ЗначениеЗаполнено(Объект.Владелец) Тогда 		
				РеквизитыСценарияПланирования 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец,
				"Владелец, НачалоСтроительства, ОкончаниеСтроительства");			
				ОбъектСтроительства		= РеквизитыСценарияПланирования.Владелец;
				НачалоРаботыПлан 		= РеквизитыСценарияПланирования.НачалоСтроительства;
				
				Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда 		
					РеквизитыОбъектаСтроительства	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСтроительства,
					"ГрафикРаботы, ЕдиницаДлительности");
					
					Объект.ГрафикРаботы 	= РеквизитыОбъектаСтроительства.ГрафикРаботы;	
					ЕдиницаДлительности	= РеквизитыОбъектаСтроительства.ЕдиницаДлительности;				
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.Родитель) Тогда 
				РеквизитыРодитель	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Объект.Родитель, ВидПланирования, ?(ЕстьОтборНаДату, КонецДня(НаДату),ТекущаяДата()));
				НачалоРаботыПлан    = РеквизитыРодитель.НачалоРаботыПлан;
				Если ЗначениеЗаполнено(РеквизитыРодитель.ЕдиницаДлительности) Тогда 
					ЕдиницаДлительности = РеквизитыРодитель.ЕдиницаДлительности; 
				КонецЕсли;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(Параметры.Предшественник) Тогда 
				НоваяСтрока = Предшественники.Добавить();
				НоваяСтрока.ОбъектСтроительстваПредшественника	= ОбъектСтроительства;
				НоваяСтрока.РаботаПредшественник 				= Параметры.Предшественник;
				НоваяСтрока.ТипЗависимости 						= Перечисления.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало;
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ЕдиницаДлительности) Тогда 
				ЕдиницаДлительности	= Перечисления.ЕдиницыИзмеренияВремени.День;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НачалоРаботыПлан) И ЗначениеЗаполнено(ДлительностьПлан) Тогда 
				ОкончаниеРаботыПлан = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьОкончаниеПериода(Объект, НачалоРаботыПлан, ДлительностьПлан, ЕдиницаДлительности);
			КонецЕсли;	
			
		Иначе
			
			ПрочитатьТекущиеДанныеРаботы();
		КонецЕсли;				
		
		ГрафикРаботыОбъектаСтроительства	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСтроительства, "ГрафикРаботы");
		ТекущийПользователь 				= Пользователи.ТекущийПользователь();
		ЕдиницыИзмеренияВремениЧас 			=  Перечисления.ЕдиницыИзмеренияВремени.Час;
		
		Если Параметры.ТекущаяЗакладкаПредшественники Тогда 
			
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПредшественники;		
		КонецЕсли;		
		
		Если Параметры.Свойство("ТекущаяСтраница")
			И ЗначениеЗаполнено(Параметры.ТекущаяСтраница) Тогда
			Если Параметры.ТекущаяСтраница = "Материалы" Тогда
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаМатериалы;
			ИначеЕсли Параметры.ТекущаяСтраница = "Ресурсы" Тогда
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРесурсы;
			КонецЕсли;
		КонецЕсли;
		
		РодительСсылка = Объект.Ссылка.Родитель;
		
		// Обработчик подсистемы "ВерсионированиеОбъектов"
		ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
		
		СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
		Организация = Объект.Владелец.Организация;
		
	КонецЕсли;
	
	ЭтоНовыйВариант = Объект.Владелец.НовыйВариант;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнююДатуИзменения(Работа)
	
	Если НЕ ЗначениеЗаполнено(Работа) Тогда
		
		Возврат НачалоДня(ТекущаяДата());
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Работа",Работа);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа,
		|	МАКСИМУМ(УСОERP_ПараметрыВыполненияРаботСрезПоследних.Период) КАК Период
		|ИЗ
		|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
		|			,
		|			Работа = &Работа
		|				И Утверждена = ЛОЖЬ
		|				И ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный)) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Возврат Выборка.Период;
			
		КонецЕсли;
		
	КонецЕсли;		
	
	Возврат НачалоДня(ТекущаяДата());
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоНовыйВариант Тогда
		
		Отказ = Истина;
		
		Если ЭтотОбъект.ВладелецФормы <> Неопределено Тогда
			
			ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаЭлементаДинамическая",Новый Структура("Ключ",Объект.Ссылка),ЭтотОбъект.ВладелецФормы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
			
			ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаЭлементаДинамическая",Новый Структура("Ключ",Объект.Ссылка));
			
		КонецЕсли;
			
	Иначе
		
		РассчитатьИтоговыеПоказателиРесурсов(ЭтаФорма);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("ЭтоНовый", Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВидПланирования", 		ВидПланирования);
	СтруктураДанных.Вставить("НачалоРаботыПлан", 		НачалоРаботыПлан);
	СтруктураДанных.Вставить("ОкончаниеРаботыПлан", 	ОкончаниеРаботыПлан);
	СтруктураДанных.Вставить("ДлительностьПлан", 		ДлительностьПлан);
	СтруктураДанных.Вставить("ЕдиницаДлительности", 	ЕдиницаДлительности);
	СтруктураДанных.Вставить("ОбъемРаботы", 		    ОбъемРаботы);
	СтруктураДанных.Вставить("ЕдиницаОбъема", 	        ЕдиницаОбъема);
	СтруктураДанных.Вставить("АвторИзменения",        	ТекущийПользователь);
	СтруктураДанных.Вставить("Утверждена", 				Ложь);	
	
	УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьПараметрыВыполненияРаботы(ТекущийОбъект.Ссылка, ВидПланирования, ?(ЕстьОтборНаДату, НачалоДня(НаДату),НачалоДня(ТекущаяДата())), СтруктураДанных);
	УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьПотребностьВМатериалах(ТекущийОбъект.Ссылка, ВидПланирования, ?(ЕстьОтборНаДату, НачалоДня(НаДату),НачалоДня(ТекущаяДата())), Материалы.Выгрузить(), ТекущийПользователь);
	УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьСвязиМеждуРаботами(ТекущийОбъект.Ссылка, ?(ЕстьОтборНаДату, НачалоДня(НаДату),НачалоДня(ТекущаяДата())), Предшественники.Выгрузить(), ТекущийПользователь);
	УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьПотребностьВРесурсах(ТекущийОбъект.Ссылка, ВидПланирования, ?(ЕстьОтборНаДату, НачалоДня(НаДату),НачалоДня(ТекущаяДата())), Ресурсы.Выгрузить(), ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура  ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("СценарийПланирования",  Объект.Владелец);
	ПараметрОповещения.Вставить("Родитель",              Объект.Родитель);
	ПараметрОповещения.Вставить("Работа",                Объект.Ссылка);
	ПараметрОповещения.Вставить("МассивИзмененныхРабот", ПараметрыЗаписи.МассивИзмененныхРабот);
	
	Если ПараметрыЗаписи.ЭтоНовый Тогда 
		Оповестить("СозданаРабота",  ПараметрОповещения, ЭтаФорма);
	Иначе	
		Оповестить("ИзмененаРабота", ПараметрОповещения, ЭтаФорма);
	КонецЕсли;	
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтоНовыйОбъект = Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка);
	ПараметрыЗаписи.Вставить("ЭтоНовыйОбъект", ЭтоНовыйОбъект);
	
	Если ЭтоНовыйОбъект ИЛИ НеобходимоПересчитатьКодСДР Тогда
		// получение кода СДР
		ДанныеКода = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДРИНомерРаботыВУровне(ТекущийОбъект.Владелец, ТекущийОбъект.Родитель);
		ТекущийОбъект.КодСДР             = ДанныеКода.КодСДР;
		ТекущийОбъект.НомерРаботыВУровне = ДанныеКода.НомерРаботыВУровне;
	КонецЕсли;
	
	ТекущийРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "Родитель");
	ПараметрыЗаписи.Вставить("ТекущийРодитель", ТекущийРодитель);
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РодительСсылка = Объект.Ссылка.Родитель;
	
	НеобходимоПересчитатьКодСДР	= Ложь;
	
	МассивИзмененныхРабот	= Новый Массив;
	МассивИзмененныхРабот.Добавить(ТекущийОбъект.Ссылка);
	
	Если ЗначениеЗаполнено(ПараметрыЗаписи.ТекущийРодитель) И ПараметрыЗаписи.ТекущийРодитель <> ТекущийОбъект.Родитель Тогда 
		УСОERP_УправлениеСтроительнымПроизводством.РассчитатьПланСценарияПланированияПроектовСтроительства(ПараметрыЗаписи.ТекущийРодитель, ВидПланирования, ?(ЕстьОтборНаДату, КонецДня(НаДату),ТекущаяДата()), МассивИзмененныхРабот);
	КонецЕсли;	
	УСОERP_УправлениеСтроительнымПроизводством.РассчитатьПланСценарияПланированияПроектовСтроительства(ТекущийОбъект.Ссылка, ВидПланирования, ?(ЕстьОтборНаДату, КонецДня(НаДату),ТекущаяДата()), МассивИзмененныхРабот);	
	
	ПараметрыЗаписи.Вставить("МассивИзмененныхРабот", МассивИзмененныхРабот);
	
	ПрочитатьТекущиеДанныеРаботы();
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьТекущиеДанныеРаботы()
	
	Результат = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Объект.Ссылка, ВидПланирования, ?(ЕстьОтборНаДату, КонецДня(НаДату),ТекущаяДата()));
	
	ОбъектСтроительства         = Результат.ОбъектСтроительства;
	НачалоРаботыПлан            = Результат.НачалоРаботыПлан;
	ОкончаниеРаботыПлан         = Результат.ОкончаниеРаботыПлан;
	ДлительностьПлан 			= Результат.ДлительностьПлан;
	ЕдиницаДлительности 		= Результат.ЕдиницаДлительности;
	ОбъемРаботы 				= Результат.ОбъемРаботы;
	ЕдиницаОбъема 				= Результат.ЕдиницаОбъема;
	
	Материалы.Загрузить(УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПотребностьВМатериалах(Объект.Ссылка, ВидПланирования, ?(ЕстьОтборНаДату, КонецДня(НаДату),ТекущаяДата())));
	Предшественники.Загрузить(УСОERP_УправлениеСтроительнымПроизводством.ПолучитьСвязиМеждуРаботами(Объект.Ссылка, ?(ЕстьОтборНаДату, КонецДня(НаДату),ТекущаяДата())));
	Ресурсы.Загрузить(УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПотребностьВРесурсах(Объект.Ссылка, ВидПланирования, ?(ЕстьОтборНаДату, КонецДня(НаДату),ТекущаяДата())));
	
	ПредшественникиКоличество 	= Предшественники.Количество();
	МатериалыКоличество			= Материалы.Количество();
	РесурсыКоличество			= Ресурсы.Количество();
	
КонецПроцедуры	

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭтапПриИзменении(Элемент)
	
	НеобходимоПересчитатьКодСДР	= РодительСсылка <> Объект.Родитель;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.Родитель	= ВыбранноеЗначение;
	НеобходимоПересчитатьКодСДР = РодительСсылка <> Объект.Родитель;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоРаботыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(НачалоРаботыПлан) И НачалоРаботыПлан = НачалоДня(НачалоРаботыПлан) Тогда
		
		ГрафикРаботы		= ?(ЗначениеЗаполнено(Объект.ГрафикРаботы), Объект.ГрафикРаботы, ГрафикРаботыОбъектаСтроительства);
		
		НачалоРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПервоеРабочееВремяДня(ГрафикРаботы, НачалоРаботыПлан);
		
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(НачалоРаботыПлан) Тогда 	
		
		ДлительностьПлан	= 0;
		
	ИначеЕсли ЗначениеЗаполнено(ОкончаниеРаботыПлан) Тогда 
		
		ДлительностьПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(Объект, 
		НачалоРаботыПлан, 
		ОкончаниеРаботыПлан, 
		ЕдиницаДлительности);
		
	ИначеЕсли ЗначениеЗаполнено(ДлительностьПлан) Тогда 	
		
		ОкончаниеРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьОкончаниеПериода(Объект, 
		НачалоРаботыПлан, 
		ДлительностьПлан, 
		ЕдиницаДлительности);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРаботыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОкончаниеРаботыПлан) И ОкончаниеРаботыПлан = НачалоДня(ОкончаниеРаботыПлан) Тогда
		
		ГрафикРаботы	= ?(ЗначениеЗаполнено(Объект.ГрафикРаботы), Объект.ГрафикРаботы, ГрафикРаботыОбъектаСтроительства);
		
		ОкончаниеРаботыПлан = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПоследнееРабочееВремяДня(ГрафикРаботы, ОкончаниеРаботыПлан);
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ОкончаниеРаботыПлан) Тогда 
		
		ДлительностьПлан = 0;	
		
	ИначеЕсли ЗначениеЗаполнено(НачалоРаботыПлан) Тогда 	
		
		ДлительностьПлан = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(Объект, 
		НачалоРаботыПлан, 
		ОкончаниеРаботыПлан, 
		ЕдиницаДлительности);
		
	ИначеЕсли ЗначениеЗаполнено(ДлительностьПлан) Тогда 
		
		НачалоРаботыПлан = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьНачалоПериода(Объект, 
		ОкончаниеРаботыПлан, 
		ДлительностьПлан, 
		ЕдиницаДлительности);	
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьПриИзменении(Элемент, ПересчитыватьРесурсы = Истина)
	
	Если ЗначениеЗаполнено(НачалоРаботыПлан) Тогда 
		ОкончаниеРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьОкончаниеПериода(Объект, НачалоРаботыПлан, ДлительностьПлан, ЕдиницаДлительности);		
	ИначеЕсли ЗначениеЗаполнено(ОкончаниеРаботыПлан) Тогда 		
		НачалоРаботыПлан    = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьНачалоПериода(Объект, ОкончаниеРаботыПлан, ДлительностьПлан, ЕдиницаДлительности);
	КонецЕсли;
	
	Если ПересчитыватьРесурсы Тогда
		
		Для Каждого СтрокиРесурсы Из Ресурсы Цикл 
			ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(СтрокиРесурсы);	
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ЕдиницаДлительностиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(НачалоРаботыПлан) Тогда 
		ОкончаниеРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьОкончаниеПериода(Объект, НачалоРаботыПлан, ДлительностьПлан, ЕдиницаДлительности);
	ИначеЕсли ЗначениеЗаполнено(ОкончаниеРаботыПлан) Тогда 		
		НачалоРаботыПлан    = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьНачалоПериода(Объект, ОкончаниеРаботыПлан, ДлительностьПлан, ЕдиницаДлительности);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Работа", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаИстория", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#Область Предшественники

&НаКлиенте
Процедура ПредшественникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПредшественникиКоличество = Предшественники.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшественникиПослеУдаления(Элемент)
	
	ПредшественникиКоличество = Предшественники.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшественникиРаботаПредшественникАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = УСОERP_УправлениеСтроительнымПроизводством.СформироватьДанныеВыбораРаботыСценарияПланирования(Текст, Объект.Владелец, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшественникиРаботаПредшественникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = УСОERP_УправлениеСтроительнымПроизводством.СформироватьДанныеВыбораРаботыСценарияПланирования(Текст, Объект.Владелец, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшественникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Предшественники.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекущиеДанные.ОбъектСтроительстваПредшественника	= ОбъектСтроительства;
		ТекущиеДанные.ТипЗависимости						= ПредопределенноеЗначение("Перечисление.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало");
		ТекущиеДанные.СценарийПланированияПредшественника	= Объект.Владелец;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшественникиОбъектСтроительстваПредшественникаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Предшественники.ТекущиеДанные;
	ТекущаяСтрока.СценарийПланированияПредшественника	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(ТекущаяСтрока.ОбъектСтроительстваПредшественника, Организация);
	
КонецПроцедуры

#КонецОбласти

#Область Материалы

&НаКлиенте
Процедура ОбъемРаботыПриИзменении(Элемент)
	
	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");
	
	Для Каждого СтрокаТаблицы Из Материалы Цикл 
		СтрокаТаблицы.КоличествоУпаковокНаОбъемРаботы	= Окр(СтрокаТаблицы.КоличествоУпаковокНаЕдиницуОбъема * ОбъемРаботы, 3);
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	
	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",       ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу",    ТекущаяСтрока.Упаковка);
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Материалы"));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте      
Процедура МатериалыХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	
	СтруктураДействий	= Новый Структура;	
	СтруктураДействий.Вставить("ХарактеристикаПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти", ЭтаФорма.ИмяФормы, "Материалы"));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	
	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаЕдиницуОбъема");
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоНаЕдиницуОбъемаУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.КоличествоУпаковокНаОбъемРаботы	= Окр(ТекущаяСтрока.КоличествоУпаковокНаЕдиницуОбъема * ОбъемРаботы, 3);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаЕдиницуОбъема");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоУпаковокНаОбъемРаботыПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;	
	
	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	МатериалыКоличество			= Материалы.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПослеУдаления(Элемент)
	
	МатериалыКоличество			= Материалы.Количество();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма, "МатериалыНоменклатураЕдиницаИзмерения", "Материалы.Упаковка");
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма,"МатериалыХарактеристика", "Материалы.ХарактеристикиИспользуются");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Ресурсы.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ресурсы.ЗагрузкаПроцент");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 100;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный); 
	
КонецПроцедуры

#КонецОбласти

#Область Ресурсы

&НаКлиенте
Процедура РесурсыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Ресурсы.ТекущиеДанные;
	ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоРесурсов(Ресурс)
	
	Возврат Новый Структура("Рабочие, Механизмы", Ресурс.Рабочие.Итог("Количество"), Ресурс.Механизмы.Итог("Количество"));
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрока)
	
	//ДлительностьПланЧас	= ?(ЕдиницаДлительности = ЕдиницыИзмеренияВремениЧас, ДлительностьПлан,
	//	УСОERP_УправлениеСтроительнымПроизводством.ПересчитатьДлительность(ДлительностьПлан, ЕдиницаДлительности, ЕдиницыИзмеренияВремениЧас, 
	//		?(ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы),ТекущаяСтрока.ГрафикРаботы, ?(ЗначениеЗаполнено(Объект.ГрафикРаботы),Объект.ГрафикРаботы, ГрафикРаботыОбъектаСтроительства))));
	//		
	
	ДлительностьПланЧас= ?(ЕдиницаДлительности = ЕдиницыИзмеренияВремениЧас, ДлительностьПлан,
	УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(Объект, 
	НачалоРаботыПлан, 
	ОкончаниеРаботыПлан, 
	ЕдиницыИзмеренияВремениЧас,
	?(ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы),ТекущаяСтрока.ГрафикРаботы, ?(ЗначениеЗаполнено(Объект.ГрафикРаботы),Объект.ГрафикРаботы, ГрафикРаботыОбъектаСтроительства))));		
	
	КоличествоРабочих =  ПолучитьКоличествоРесурсов(ТекущаяСтрока.Ресурс);
	
	ТекущаяСтрока.Трудоемкость	= ТекущаяСтрока.Количество * ТекущаяСтрока.ЗагрузкаПроцент /100 
	* КоличествоРабочих.Рабочие* ДлительностьПланЧас;
	
	ТекущаяСтрока.Машиноемкость	= ТекущаяСтрока.Количество * ТекущаяСтрока.ЗагрузкаПроцент /100 
	* КоличествоРабочих.Механизмы * ДлительностьПланЧас;
	
	РассчитатьИтоговыеПоказателиРесурсов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыЗагрузкаПроцентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Ресурсы.ТекущиеДанные;
	ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыРесурсПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Ресурсы.ТекущиеДанные;
	ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыГрафикРаботыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Ресурсы.ТекущиеДанные;
	ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказателиРесурсов(Форма)
	
	Форма.ТрудоемкостьИтог 	= Форма.Ресурсы.Итог("Трудоемкость");
	Форма.МашиноемкостьИтог = Форма.Ресурсы.Итог("Машиноемкость");
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РесурсыКоличество			= Ресурсы.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПослеУдаления(Элемент)
	
	РесурсыКоличество			= Ресурсы.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыТрудоемкостьПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Ресурсы.ТекущиеДанные;
	РесурсыТрудоемкостьПриИзмененииНаКлиенте(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура РесурсыТрудоемкостьПриИзмененииНаКлиенте(ТекущаяСтрока)
	ОбщаяТрудоемкость = Ресурсы.Итог("Трудоемкость");
	
	ДлительностьПланЧас= ?(ЕдиницаДлительности = ЕдиницыИзмеренияВремениЧас, ДлительностьПлан,
	УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(Объект, 
	НачалоРаботыПлан, 
	ОкончаниеРаботыПлан, 
	ЕдиницыИзмеренияВремениЧас,
	?(ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы),ТекущаяСтрока.ГрафикРаботы, ?(ЗначениеЗаполнено(Объект.ГрафикРаботы),Объект.ГрафикРаботы, ГрафикРаботыОбъектаСтроительства))));		
	
	КоличествоРабочих =  ПолучитьКоличествоРесурсов(ТекущаяСтрока.Ресурс);
	
	Трудоемкость	= ТекущаяСтрока.Количество * ТекущаяСтрока.ЗагрузкаПроцент /100 
	* КоличествоРабочих.Рабочие* ДлительностьПланЧас;
	
	
	Машиноемкость	= ТекущаяСтрока.Количество * ТекущаяСтрока.ЗагрузкаПроцент /100 
	* КоличествоРабочих.Механизмы * ДлительностьПланЧас;
	
	МаксПропроцияИзмененияДлительности = Макс(
	?(Трудоемкость = 0, 0, ТекущаяСтрока.Трудоемкость / Трудоемкость), 
	?(Машиноемкость = 0, 0, ТекущаяСтрока.Машиноемкость / Машиноемкость));	
	
	Если МаксПропроцияИзмененияДлительности <> 0 Тогда
		
		ДлительностьПлан	= ДлительностьПлан * МаксПропроцияИзмененияДлительности;	
		ДлительностьПриИзменении(Неопределено, Ложь);
		
	КонецЕсли; 
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
